Config/Documents/ВводИсторииКапвложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВводИсторииКапвложений</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ИсторияКапвложений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийВводИсторииКапвложений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоАгрегаторДвижений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсторияОпераций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектВложений</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОбъектКапвложений</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КарточкаКапвложений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КарточкиКапвложений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетВложения</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПССчетВложения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭКСчетВложения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦМОСчетВложения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦМО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКорр</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПССчетКорр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭКСчетКорр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоСчетКорр1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоСчетКорр2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоСчетКорр3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОперации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СторонаСчетВложения</Name>
							<Comment>Счет вложений по дебету или кредиту</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>2</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>254</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПервичногоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПервичногоДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПервичногоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаВложений</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаДвиженияКорр</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/AccountingRegisters/ЖурналПроводокЕПСБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>ЖурналПроводокЕПСБУ</Name>
			<ChartOfAccounts>ChartOfAccounts.ЕПСБУ</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КПС</Name>
					<Comment>Классификационный признак счета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКПС</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КЭК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКЭК</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИФО</Name>
					<Comment>Источник финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЖурналОпераций</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Журналы</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КФО</Name>
					<Comment>Код финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНеУчитываетсяНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНеУчитываемых</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЕНВД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетЕНВД</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНДС</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияДт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияКт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМежотчетногоПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМежотчетногоПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Config/Enums/ВидыОперацийВводИсторииКапвложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийВводИсторииКапвложений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводКарточекКапвложенийПоОстаткам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводИсторииКарточекКапвложений</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/ВводИсторииКапвложений/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды    
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ВерсионированиеОбъектов
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	ЗаполнитьФормуИзДокумента();
	УстановитьВидимостьЭлементов(ЭтотОбъект);

	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОтборСтрок();

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	УстановитьЗаголовокТаблицыИстории();
	Элементы.ГруппаАгрегатор.Видимость = Объект.ЭтоАгрегаторДвижений;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	УстановитьЗаголовокТаблицыИстории();
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область  ОбработчикиСобытийЭлементовТаблицыФормыИсторияОпераций

&НаКлиенте
Процедура ИсторияОперацийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Элементы.Объекты.ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОперацийВводИсторииКапвложений.ВводКарточекКапвложенийПоОстаткам") Тогда
		Если Элементы.КарточкиКапвложений.ТекущиеДанные = Неопределено Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияОперацийПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийВводИсторииКапвложений.ВводКарточекКапвложенийПоОстаткам") Тогда
			Элементы.ИсторияОпераций.ТекущиеДанные.ОбъектВложений = Элементы.Объекты.ТекущиеДанные.ОбъектВложений;
		Иначе	
			Элементы.ИсторияОпераций.ТекущиеДанные.ОбъектВложений      = Элементы.КарточкиКапвложений.ТекущиеДанные.ОбъектВложений;
			Элементы.ИсторияОпераций.ТекущиеДанные.КарточкаКапвложений = Элементы.КарточкиКапвложений.ТекущиеДанные.КарточкаКапвложений;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияОперацийСчетВложенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = ТекущийЭлемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	НачалоВыбораПолногоСчета(ТекущиеДанные, Элемент, ДанныеВыбора, СтандартнаяОбработка, "СчетВложения");
КонецПроцедуры

&НаКлиенте
Процедура ИсторияОперацийСчетВложенияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТекущиеДанные = ТекущийЭлемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено ИЛИ ТипЗнч(ВыбранноеЗначение) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;	
	ОбработкаВыбораПолногоСчета(ТекущиеДанные, ВыбранноеЗначение, СтандартнаяОбработка, "СчетВложения");
КонецПроцедуры

&НаКлиенте
Процедура ИсторияОперацийСчетКоррНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = ТекущийЭлемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	НачалоВыбораПолногоСчета(ТекущиеДанные, Элемент, ДанныеВыбора, СтандартнаяОбработка, "СчетКорр");
КонецПроцедуры

&НаКлиенте
Процедура ИсторияОперацийСчетКоррОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТекущиеДанные = ТекущийЭлемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено ИЛИ ТипЗнч(ВыбранноеЗначение) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;	
	ОбработкаВыбораПолногоСчета(ТекущиеДанные, ВыбранноеЗначение, СтандартнаяОбработка, "СчетКорр");
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийТаблицыФормыОбъекты

&НаКлиенте
Процедура ОбъектыПриАктивизацииСтроки(Элемент)
	УстановитьОтборСтрок("Объекты");
	УстановитьЗаголовокТаблицыИстории();
	УстановитьЗаголовокТаблицыКарточек()
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	УстановитьОтборСтрок("Объекты");
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыПередУдалением(Элемент, Отказ)
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	УдалитьСвязанныеСтрокиТаблиц(ТекДанные.ОбъектВложений);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыДатаНачалаВложенийПриИзменении(Элемент)
	ТекДанные = ТекущийЭлемент.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ДатаНачалаВложений = ТекДанные["ДатаНачалаВложений"];
	Отбор = Новый Структура("ОбъектВложений", ТекДанные["ОбъектВложений"]);
	СтрокиИстории = Объект.ИсторияОпераций.НайтиСтроки(Отбор);
	Для Каждого СтрокаИстории Из СтрокиИстории Цикл
		СтрокаИстории.ДатаНачалаВложений = ДатаНачалаВложений;
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыКарточкиКапвложений

&НаКлиенте
Процедура КарточкиКапвложенийПриАктивизацииСтроки(Элемент)
	УстановитьОтборСтрок("Карточки");
	УстановитьЗаголовокТаблицыИстории();
КонецПроцедуры

&НаКлиенте
Процедура КарточкиКапвложенийПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.КарточкиКапвложений.ТекущиеДанные.ОбъектВложений = Элементы.Объекты.ТекущиеДанные.ОбъектВложений;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КарточкиКапвложенийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Если Элементы.Объекты.ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КарточкиКапвложенийПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	УстановитьОтборСтрок("Карточки");
КонецПроцедуры

&НаКлиенте
Процедура КарточкиКапвложенийПередУдалением(Элемент, Отказ)
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	УдалитьСвязанныеСтрокиТаблиц(ТекДанные.КарточкаКапвложений);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура СнятьПризнакАгрегатора(Команда)
	
	ВводНачальныхОстатковКлиент.СнятьПризнакАгрегатора(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОстаткам106(Команда)
	Если Объект.Проведен Тогда
		СообщитьПользователюОбОтменеПроведения();
		Возврат;
	КонецЕсли;	

	Объекты.Очистить();
	КарточкиКапвложений.Очистить();
	ЗаполнитьПоОстаткамНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИсторию(Команда)       
	Если Объект.Проведен Тогда
		СообщитьПользователюОбОтменеПроведения();
		Возврат;
	КонецЕсли;	

	Объекты.Очистить();
	КарточкиКапвложений.Очистить();
	ЗаполнитьИсториюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКарточкиКапвложений(Команда)
	ЗаполнитьКарточкиКапвложенийНаСервере();
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьОтборСтрокИстории()  
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийВводИсторииКапвложений.ВводКарточекКапвложенийПоОстаткам") Тогда
		ДанныеСтроки = Элементы.Объекты.ТекущиеДанные;
		Если ДанныеСтроки = Неопределено Тогда
			ОтборОпераций = Новый ФиксированнаяСтруктура("ОбъектВложений", Неопределено);
		Иначе	
			ОтборОпераций = Новый ФиксированнаяСтруктура("ОбъектВложений", ДанныеСтроки.ОбъектВложений);
		КонецЕсли;	
		Элементы.ИсторияОпераций.ОтборСтрок = ОтборОпераций;
	Иначе	
		ДанныеСтроки = Элементы.КарточкиКапвложений.ТекущиеДанные;
		Если ДанныеСтроки = Неопределено Тогда
			ОтборОпераций = Новый ФиксированнаяСтруктура("ОбъектВложений, КарточкаКапвложений", Неопределено, Неопределено);
		Иначе	
			ОтборОпераций = Новый ФиксированнаяСтруктура("ОбъектВложений, КарточкаКапвложений", 
				ДанныеСтроки.ОбъектВложений, ДанныеСтроки.КарточкаКапвложений);
		КонецЕсли;	
		Элементы.ИсторияОпераций.ОтборСтрок = ОтборОпераций;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСтрокКарточек()  
	Если Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОперацийВводИсторииКапвложений.ВводКарточекКапвложенийПоОстаткам") Тогда
		ДанныеСтроки = Элементы.Объекты.ТекущиеДанные;
		Если ДанныеСтроки = Неопределено Тогда
			ОтборКарточек = Новый ФиксированнаяСтруктура("ОбъектВложений", Неопределено);
		Иначе	
			ОтборКарточек = Новый ФиксированнаяСтруктура("ОбъектВложений", ДанныеСтроки.ОбъектВложений);
		КонецЕсли;	
		Элементы.КарточкиКапвложений.ОтборСтрок = ОтборКарточек;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСтрок(ТаблицаИсточникИзменений = "")  
	Если ТаблицаИсточникИзменений = "Карточки" Тогда
		УстановитьОтборСтрокИстории();
	Иначе	
		УстановитьОтборСтрокКарточек();
		УстановитьОтборСтрокИстории();
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементов(Форма)
	
	ТекВидОперации = Форма.Объект.ВидОперации;
	ЭтоПервоеПрименение = (Форма.Объект.ВидОперации = 
		ПредопределенноеЗначение("Перечисление.ВидыОперацийВводИсторииКапвложений.ВводКарточекКапвложенийПоОстаткам"));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"КарточкиКапвложений", "Видимость", НЕ ЭтоПервоеПрименение);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ОбъектыСумма", "Видимость", ЭтоПервоеПрименение);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ОбъектыДатаНачалаВложений", "Видимость", ЭтоПервоеПрименение);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ФормаЗаполнитьИсторию", "Видимость", НЕ ЭтоПервоеПрименение);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ФормаЗаполнитьПоОстаткам106", "Видимость", ЭтоПервоеПрименение);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ИсторияОперацийЗаполнитьКарточкиКапвложений", "Видимость", ЭтоПервоеПрименение);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ИсторияОперацийКарточкаКапвложений", "Видимость", ЭтоПервоеПрименение);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ИсторияОперацийКЭКСчетВложения", "Видимость", НЕ ЭтоПервоеПрименение);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ИсторияОперацийСчетКорр", "Видимость", НЕ ЭтоПервоеПрименение);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ИсторияОперацийКПССчетКорр", "Видимость", НЕ ЭтоПервоеПрименение);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ИсторияОперацийКЭКСчетКорр", "Видимость", НЕ ЭтоПервоеПрименение);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ИсторияОперацийСубконтоСчетКорр1", "Видимость", НЕ ЭтоПервоеПрименение);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ИсторияОперацийСубконтоСчетКорр2", "Видимость", НЕ ЭтоПервоеПрименение);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ИсторияОперацийСубконтоСчетКорр3", "Видимость", НЕ ЭтоПервоеПрименение);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ИсторияОперацийВидПервичногоДокумента", "Видимость", НЕ ЭтоПервоеПрименение);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ИсторияОперацийДатаПервичногоДокумента", "Видимость", НЕ ЭтоПервоеПрименение);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ИсторияОперацийНомерПервичногоДокумента", "Видимость", НЕ ЭтоПервоеПрименение);
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьФормуИзДокумента()
	ТабОбъектов = Объект.ИсторияОпераций.Выгрузить(,"ОбъектВложений, ДатаНачалаВложений, Сумма");
	ТабОбъектов.Свернуть("ОбъектВложений, ДатаНачалаВложений", "Сумма");
	Для каждого ТекОбъект Из ТабОбъектов Цикл
		НоваяСтрока = Объекты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекОбъект);
		НоваяСтрока.ОбъектВложенийПредставление = Строка(НоваяСтрока.ОбъектВложений);
	КонецЦикла;	
	
	ТабКарточек = Объект.ИсторияОпераций.Выгрузить(,"ОбъектВложений, КарточкаКапвложений");
	ТабКарточек.Свернуть("ОбъектВложений, КарточкаКапвложений");
	Для каждого ТекКарточка Из ТабКарточек Цикл
		НоваяСтрока = КарточкиКапвложений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекКарточка);
		НоваяСтрока.КарточкаКапвложенийПредставление = Строка(НоваяСтрока.КарточкаКапвложений);
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьПоОстаткамНаСервере()   
	Объект.ИсторияОпераций.Очистить();
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЖурналПроводокЕПСБУОстатки.Субконто1 КАК ОбъектВложений,
	|	ЖурналПроводокЕПСБУОстатки.Субконто2 КАК ЦМОСчетВложения,
	|	ЖурналПроводокЕПСБУОстатки.Подразделение КАК Подразделение,
	|	ЖурналПроводокЕПСБУОстатки.КФО КАК КФО,
	|	ЖурналПроводокЕПСБУОстатки.Счет КАК СчетВложения,
	|	ЖурналПроводокЕПСБУОстатки.КПС КАК КПССчетВложения,
	|	ЖурналПроводокЕПСБУОстатки.ИФО КАК ИФО,
	|	&СторонаСчетВложения КАК СторонаСчетВложения,
	|	&Содержание КАК Содержание,
	|	&ДатаПолученияОстатков КАК ДатаОперации,
	|	СУММА(ЖурналПроводокЕПСБУОстатки.КоличествоОстаток) КАК Количество,
	|	СУММА(ЖурналПроводокЕПСБУОстатки.СуммаОстаток) КАК Сумма
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(&ДатаПолученияОстатков, Счет В (&СчетаКапвложений), , Организация = &Организация) КАК ЖурналПроводокЕПСБУОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЖурналПроводокЕПСБУОстатки.Субконто1,
	|	ЖурналПроводокЕПСБУОстатки.Субконто2,
	|	ЖурналПроводокЕПСБУОстатки.Подразделение,
	|	ЖурналПроводокЕПСБУОстатки.КФО,
	|	ЖурналПроводокЕПСБУОстатки.Счет,
	|	ЖурналПроводокЕПСБУОстатки.КПС,
	|	ЖурналПроводокЕПСБУОстатки.ИФО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИсторияКапвложенийОбороты.ОбъектВложений КАК ОбъектВложений
	|ПОМЕСТИТЬ ОбъектыСКарточкамиПервогоПрименения
	|ИЗ
	|	РегистрНакопления.ИсторияКапвложений.Обороты(
	|			,
	|			,
	|			,
	|			ОбъектВложений В
	|					(ВЫБРАТЬ
	|						Таб.ОбъектВложений
	|					ИЗ
	|						Остатки КАК Таб)
	|				И КарточкаКапвложений.ВидКапвложений = &ВидКапвложенияПервоеПрименение) КАК ИсторияКапвложенийОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.ОбъектВложений КАК ОбъектВложений,
	|	Остатки.Подразделение КАК Подразделение,
	|	Остатки.КФО КАК КФО,
	|	Остатки.СчетВложения КАК СчетВложения,
	|	Остатки.КПССчетВложения КАК КПССчетВложения,
	|	Остатки.ЦМОСчетВложения КАК ЦМОСчетВложения,
	|	Остатки.ИФО КАК ИФО,
	|	Остатки.СторонаСчетВложения КАК СторонаСчетВложения,
	|	Остатки.Содержание КАК Содержание,
	|	Остатки.ДатаОперации КАК ДатаОперации,
	|	Остатки.Количество КАК Количество,
	|	Остатки.Сумма КАК Сумма
	|ИЗ
	|	Остатки КАК Остатки
	|ГДЕ
	|	НЕ Остатки.ОбъектВложений В
	|				(ВЫБРАТЬ
	|					Таб.ОбъектВложений
	|				ИЗ
	|					ОбъектыСКарточкамиПервогоПрименения КАК Таб)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СторонаСчетВложения", "Дт");
	
	ДатаПолученияОстатков = КонецДня(Объект.Дата) + 1;
	Запрос.УстановитьПараметр("Содержание", 
		СтрШаблон(НСтр("ru = 'Отражение остатка по объекту капитальных вложений на %1'"), 
		Формат(ДатаПолученияОстатков, "ДЛФ=D;")));
		
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ДатаПолученияОстатков", ДатаПолученияОстатков);
	Запрос.УстановитьПараметр("СчетаКапвложений", ОбслуживаниеКарточекКапвложений.СчетаКапвложенийДляКарточкиКапвложений());
	Запрос.УстановитьПараметр("ВидКапвложенияПервоеПрименение", ПредопределенноеЗначение("Перечисление.ВидыКапвложений.ПервоеПрименение"));
	
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.ИсторияОпераций.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;	

	ЗаполнитьФормуИзДокумента();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсториюНаСервере()
	Объект.ИсторияОпераций.Очистить();
	
	ТаблицаИстории = Документы.ВводИсторииКапвложений.ТаблицаИсторииКапвложений(Объект.Дата, Объект.Организация);
	
	Для каждого СтрокаПроводки Из ТаблицаИстории Цикл 
		НоваяСтрока = Объект.ИсторияОпераций.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПроводки);
	КонецЦикла;	

	ЗаполнитьФормуИзДокумента();
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьКарточкиКапвложенийНаСервере()
	ТабОбъектов = Объект.ИсторияОпераций.Выгрузить(, "ОбъектВложений");
	ТабОбъектов.Свернуть("ОбъектВложений");
	МассивОбъектов = ТабОбъектов.ВыгрузитьКолонку("ОбъектВложений");
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КарточкиКапвложений.Ссылка КАК КарточкаКапвложений,
	|	КарточкиКапвложений.ОбъектВложений КАК ОбъектВложений
	|ИЗ
	|	Справочник.КарточкиКапвложений КАК КарточкиКапвложений
	|ГДЕ
	|	КарточкиКапвложений.ОбъектВложений В(&МассивОбъектов)
	|	И КарточкиКапвложений.Владелец = &Организация
	|	И КарточкиКапвложений.ВидКапвложений = &ВидКапвложенийПервоеПрименение";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	ВидКапвложенийПервоеПрименение = ПредопределенноеЗначение("Перечисление.ВидыКапвложений.ПервоеПрименение");
	Запрос.УстановитьПараметр("ВидКапвложенийПервоеПрименение", ВидКапвложенийПервоеПрименение);
	ТабКарточек = Запрос.Выполнить().Выгрузить();  
	
	Для каждого ТекОбъект Из МассивОбъектов Цикл
		СтрокаКарточки = ТабКарточек.Найти(ТекОбъект, "ОбъектВложений");
		
		// Найдем дату начала формирования вложений для объекта
		ДатаНачалаВложений = Дата(1,1,1);
		Отбор = Новый Структура("ОбъектВложений", ТекОбъект);
		ПроводкиОбъекта = Объект.ИсторияОпераций.НайтиСтроки(Отбор);
		Если ПроводкиОбъекта.Количество() > 0 И ЗначениеЗаполнено(ПроводкиОбъекта[0].ДатаНачалаВложений) Тогда
			ДатаНачалаВложений = ПроводкиОбъекта[0].ДатаНачалаВложений;
		КонецЕсли;	
		
		Если СтрокаКарточки = Неопределено Тогда
			КарточкаОбъект = Справочники.КарточкиКапвложений.СоздатьЭлемент();
			КарточкаОбъект.Владелец       = Объект.Организация;
			КарточкаОбъект.ОбъектВложений = ТекОбъект;
			КарточкаОбъект.ВидКапвложений = ВидКапвложенийПервоеПрименение;
			КарточкаОбъект.Наименование   = Справочники.КарточкиКапвложений.НаименованиеИзРеквизитов(ТекОбъект, ВидКапвложенийПервоеПрименение);
			КарточкаОбъект.Комментарий    = НСтр("ru = 'Создана программно документом ""Ввод истории капвложений""'");
			КарточкаОбъект.ДатаНачалаВложений = ДатаНачалаВложений;
			КарточкаОбъект.Записать();
			
			ТекКарточка = КарточкаОбъект.Ссылка;

			НоваяСтрока = ТабКарточек.Добавить();
			НоваяСтрока.ОбъектВложений      = ТекОбъект;
			НоваяСтрока.КарточкаКапвложений = ТекКарточка;
		Иначе
			ТекКарточка = СтрокаКарточки.КарточкаКапвложений;   

			Если ЗначениеЗаполнено(ДатаНачалаВложений) Тогда
				НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
				Попытка	
					Блокировка = Новый БлокировкаДанных;
					ЭлементБлокировки = Блокировка.Добавить("Справочник.КарточкиКапвложений");
					ЭлементБлокировки.УстановитьЗначение("Ссылка", ТекКарточка);
					ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
					Блокировка.Заблокировать();

					КарточкаОбъект = ТекКарточка.ПолучитьОбъект();          
					КарточкаОбъект.ДатаНачалаВложений = ДатаНачалаВложений;
					КарточкаОбъект.Записать();

					ТекКарточка = КарточкаОбъект.Ссылка;   

					ЗафиксироватьТранзакцию();  
				Исключение   
					ОтменитьТранзакцию(); 
					ТекстОшибки = СтрШаблон(
						Нстр("ru = 'Карточку капвложений первого применения ""%1"" не удалось заблокировать'", ОбщегоНазначения.КодОсновногоЯзыка()), 
						КарточкаОбъект.Наименование);
					ЗаписьЖурналаРегистрации(ТекстОшибки, УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.ВводИсторииКапвложений);
					ВызватьИсключение;
				КонецПопытки;	
			КонецЕсли;	
		КонецЕсли;	                                            
		
		Для каждого ТекПроводка Из ПроводкиОбъекта Цикл
			ТекПроводка.КарточкаКапвложений = ТекКарточка;
		КонецЦикла;	
	КонецЦикла;	     
	
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьЗаголовокТаблицыИстории()
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийВводИсторииКапвложений.ВводКарточекКапвложенийПоОстаткам") Тогда
		Текст = НСтр("ru = 'История операций'");
	Иначе
		ТекДанные = Элементы.КарточкиКапвложений.ТекущиеДанные;
		Текст = НСтр("ru = 'История операций карточки'");
		Если ТекДанные <> Неопределено И ЗначениеЗаполнено(ТекДанные.КарточкаКапвложений) Тогда
			Текст = Текст + ": " + ТекДанные.КарточкаКапвложенийПредставление;
		КонецЕсли;	     
	КонецЕсли;	
	Элементы.ГруппаТЧПравая.Заголовок = Текст;
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьЗаголовокТаблицыКарточек()
	ТекДанные = Элементы.Объекты.ТекущиеДанные;
	Текст = НСтр("ru = 'Карточки объекта'");
	Если ТекДанные <> Неопределено И ЗначениеЗаполнено(ТекДанные.ОбъектВложений) Тогда
		Текст = Текст + ": " + ТекДанные.ОбъектВложенийПредставление;
	КонецЕсли;	     
	Элементы.КарточкиКапвложений.Заголовок = Текст;
КонецПроцедуры	

&НаКлиенте
Процедура УдалитьСтрокиТаблицы(Таблица, ОбъектПоиска, КолонкаПоиска)
	МаксИндекс = Таблица.Количество() - 1;
	Для к = - МаксИндекс По 0 Цикл
		Индекс = -к;
		Если Таблица[Индекс][КолонкаПоиска] <> ОбъектПоиска Тогда
			Продолжить;
		КонецЕсли;	   
		Таблица.Удалить(Индекс);
	КонецЦикла;	
КонецПроцедуры	

&НаКлиенте
Процедура УдалитьСвязанныеСтрокиТаблиц(УдаляемыйОбъект)
	ТипУдаляемогоОбъекта = ТипЗнч(УдаляемыйОбъект);
	ТипОС = Тип("СправочникСсылка.ОсновныеСредства");
	ТипКарточкаКапвложений = Тип("СправочникСсылка.КарточкиКапвложений");
	
	Если ТипУдаляемогоОбъекта = ТипОС Тогда
		УдалитьСтрокиТаблицы(КарточкиКапвложений, УдаляемыйОбъект, "ОбъектВложений");
		УдалитьСтрокиТаблицы(Объект.ИсторияОпераций, УдаляемыйОбъект, "ОбъектВложений");
	ИначеЕсли ТипУдаляемогоОбъекта = ТипКарточкаКапвложений Тогда
		УдалитьСтрокиТаблицы(Объект.ИсторияОпераций, УдаляемыйОбъект, "КарточкаКапвложений");
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура СообщитьПользователюОбОтменеПроведения()
	ОбщегоНазначенияКлиент.СообщитьПользователю(Нстр("ru = 'Для заполнения документа нужно отменить проведение.'"));
КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораПолногоСчета(ТекущиеДанные, Элемент, ДанныеВыбора, СтандартнаяОбработка, ИмяПоляСчета)
	ТекущийСчет = Новый Структура("Счет, КПС, КФО");
	ТекущийСчет.Счет = ТекущиеДанные[ИмяПоляСчета];
	ТекущийСчет.КПС  = ТекущиеДанные["КПС" + ИмяПоляСчета];
	ТекущийСчет.КФО  = ТекущиеДанные["КФО"];
	
	Если ИмяПоляСчета = "СчетВложения" Тогда
		ОграниченияСчетов = ОбслуживаниеКарточекКапвложенийВызовСервера.СчетаКапвложенийДляКарточкиКапвложений();
		БухгалтерскийУчетКлиент.ОткрытьФормуВыбораРабочегоСчета(Элемент, СтандартнаяОбработка, ТекущийСчет,
			Объект.Организация,, ОграниченияСчетов, ТекущиеДанные.КФО,, Объект.Дата);
	Иначе
		БухгалтерскийУчетКлиент.ОткрытьФормуВыбораРабочегоСчета(Элемент, СтандартнаяОбработка, ТекущийСчет,
			Объект.Организация,,, ТекущиеДанные.КФО,, Объект.Дата);
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ОбработкаВыбораПолногоСчета(ТекущиеДанные, ВыбранноеЗначение, СтандартнаяОбработка, ИмяПоляСчета)
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;	

	СтандартнаяОбработка = Ложь;
	Если ИмяПоляСчета = "СчетВложения" Тогда
		ТекущиеДанные.СчетВложения    = ВыбранноеЗначение.Счет;
		ТекущиеДанные.КПССчетВложения = ВыбранноеЗначение.КПС;
		ТекущиеДанные.КЭКСчетВложения = ?(ТекущиеДанные.СторонаСчетВложения = "Дт", ВыбранноеЗначение.КОСГУДт, ВыбранноеЗначение.КОСГУКт);
	Иначе
		ТекущиеДанные.СчетКорр    = ВыбранноеЗначение.Счет;
		ТекущиеДанные.КПССчетКорр = ВыбранноеЗначение.КПС;
		ТекущиеДанные.КЭКСчетКорр = ?(ТекущиеДанные.СторонаСчетВложения = "Дт", ВыбранноеЗначение.КОСГУДт, ВыбранноеЗначение.КОСГУКт);
	КонецЕсли;	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
